
def text_command_start(message):
    text = f'Здравствуйте {message.from_user.first_name}, \n' \
           f'рад вас видеть в Botintegral!\n\n' \
           f'Работать с ботом вы можете через команды ' \
           f'(/help - список команд) или через меню.\n\n' \
           f'Если у вас возникли проблемы с ботом (долго отвечает ' \
           f'(более минуты) или информация в боте неактуальна), ' \
           f'просьба сообщить о данных проблемах администратору бота через' \
           f' команду /hadm или через меню (Информация -> Связь с администратором).'
    return text


# todo подумать над оформлением текста и вынести все текстовые сообщения в этот файл
def text_command_help():
    text = 'В этом разделе вы сможете познакомится с  командами которые есть в боте\n\n\n' \
                         '/start - Запуск бота.\n' \
                         '/help - Список команд.\n' \
                         '/hadm - Связь с администратором.\n' \
                         '/reg - Зарегистрироваться в Botintegral.\n' \
                         '/ry8b - Расписание уроков 8Б'
    return text


def text_ry8b():
    text = 'Расписание уроков 8Б класс\n\n\n'\
                                       'Понедельник:\n'\
                                       '[8:30 - 9:10]    Разговоры о важном\n[9:20 - 10:00]  Физика\n'\
                                       '[10:10 - 10:50]История России\n[11:15 - 11:55]Алгебра\n'\
                                       '[12:20 - 13:00]География\n[13:15 - 13:55]Русский язык.\n\n'\
                                       'Вторник:\n[8:30 - 9:10]Геометрия\n'\
                                       '[9:20 - 10:00]Геометрия\n[10:10 - 10:50]Алгебра\n'\
                                       '[11:15 - 11:55]Обществознание\n[12:20 - 13:00]Физкультура\n'\
                                       '[13:15 - 13:55]Иностранный язык\n[14:05 - 14:45]Классный час.\n\n'\
                                       'Среда:\n[9:20 - 10:00]История Россиии\n'\
                                       '[10:10 - 10:50]Физика\n[11:15 - 11:55]Химия\n'\
                                       '[12:20 - 13:00]Алгебра\n[13:15 - 13:55]Музыка\n'\
                                       '[14:05 - 14:45]Иностранный язык\n\n'\
                                       'Четверг:\n[8:30 - 9:10]География\n[9:20 - 10:00]Литература\n'\
                                       '[10:10 - 10:50]ОПД\n[11:15 - 11:55]Физкультура\n[12:22 - 13:00]Алгебра\n\n'\
                                       'Пятница:\n[8:30 - 9:10]Технология\n[9:20 - 10:00]Русский язык\n'\
                                       '[10:10 - 10:50]Биолгия\n[11:15 - 11:55]Физкультура\n'\
                                       '[12:20 - 13:00]Информатика\n\n'\
                                       'Суббота:\n[8:30 - 9:10]Биология\n[9:20 - 10:00]Иностранный язык\n'\
                                       '[10:10 - 10:50]Химия\n[11:15 - 11:55]Русский язык\n'\
                                       '[12:20 - 13:00]Литература\n[13:15 - 13:55]ОБЖ.'
    return text


def text_help_admin():
    text = 'Нам очень жаль, что вы столкнулись с ошибкой в боте,'\
            ' просим вас сообщить о поблеме в личном сообщении нашему администратору.\n'\
            '⬇️⬇️⬇️'
    return text


def text_o_bot():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def vopros_ryss1():
    text = 'Вопрос 1:\n\n' \
           'Дайте определение терминам «синтаксис», «пунктуация», «язык», «речь», «лексика»,' \
           ' «фразеология», «орфоэпия», «фонетика», «лингвистика».'
    return text


def otvet_ryss1():
    text = '''
    Ответ:
    
    Синтаксис - это раздел лингвистики, который изучает словосочетанияб предложения и их строени.
    
    Пунктуация - это раздел языкознания, в котором изложены правила постановки знаков препинания.
    
    Язык - это система фонетических, лексических и грамматических средств, являющаяся орудием выражения мыслей, чувств, 
    служащая важнейшим средством общения людей.
    
    Речь - исторически сложившаяся форма общения людей посредством языковых конструкций, создаваемых на основе
     определенных правил.
    
    Лексика - это словарный состав языка, то есть совокупность всех слов данного языка.
    
    Фразеология - раздел лингвистики, изучающий утойчивые сочетания, речевые обороты и выражения.
    
    Орфоэпия - это наука, которая занимается тем, что изучает равильое произношение слов.
    
    Фонетика - раздел лингвистики, изучающий звуки, речь и звуковые единицы.
    
    Лингвистика - наука о языке, его свойствах, строении и функционировании. 
    '''
    return text


def vopros_ryss2():
    text = 'Вопрос 2:\n\n' \
           'Дайте определение термину «словосочетание». ' \
           'С помощью чего осуществляется связь слов в словосочетании. ' \
           'Что не является словосочетанием? Приведите примеры глагольных, именных и наречных словосочетаний.'
    return text


def otvet_ryss2():
    text = '''
    Ответ:
    
    Словосочетание  —  синтаксическая  конструкция, образуемая соединением двух или более самостоятельных  \
    (знаменательных)  слов  на  основе  подчинительной  связи. Эта  связь  осуществляется грамматически \
    (с помощью предлога и окончания зависимого слова или  только  окончания  зависимого  слова)  и по  \
    смыслу(звонк[ого] голоса,  ушёл в лес[] )  или только по  смыслу (очень красивый, невнятно говорить).

    
    Связь слов в словосочетании осуществуется:
        1) согласование — вид связи, при котором зависимое слово равняется в своей форме главному слову, \
        то есть согласуется с ним в роде, числе и падеже: необычный прибор, об интересном событии 
        2)управление — вид связи, при котором зависимое слово употребляется
         в определенной падежной форме в зависимости \
        от лексико-грамматического значения главного слова: симпатия к соседу, слушать лекцию 
        3)примыкание — вид связи, при котором зависимость слова выражается лексически, порядком слов и интонацией, \
        без применения служебных слов или морфологического изменения: петь звонко, смотреть молча.
    
    Словосочетанием не является:
        1) грамматическая основа. Наступила зима (пример).
        2) Не сочетаемые слова. О котором, причитался (пример).
        3) Однородные члены предложения. Не светит, а греет (пример).
        4) Степени сравнения прилагательных. Более красивый (пример).
    
        '''
    return text


def vopros_ryss3():
    text = '''
    Вопрос 3:
    
    
    Расскажите о типах подчинительной связи «согласование», «управление», «примыкание».  \
    Приведите примеры словосочетаний с разными типами связи. Замените  словосочетания «казачьи набеги», \
    «царство зимы» синонимичными словосочетаниями с другим типом подчинительной связи.
    '''
    return text


def otvet_ryss3():
    text = '''
    Ответ:
    
        Согласование — вид связи, при котором зависимое слово равняется в своей форме главному слову, \
        то есть согласуется с ним в роде, числе и падеже: необычный прибор, об интересном событии 
        
        Управление — вид связи, при котором зависимое слово употребляется в определенной падежной форме в зависимости \
        от лексико-грамматического значения главного слова: симпатия к соседу, слушать лекцию 
        
        Примыкание — вид связи, при котором зависимость слова выражается лексически, порядком слов и интонацией, \
        без применения служебных слов или морфологического изменения: петь звонко, смотреть молча.
        
        
        
    '''
    return text


def vopros_ryss4():
    text = '''
    Вопрос 4:
    
    
    Дайте определение термину «предложение». Какие бывают предложения по цели высказывания? По эмоциональной окраске? \
    По количеству грамматических основ? По характеру грамматической основы?
     По наличию второстепенных членов предложения?\
     По условиям контекста и речевой ситуации? По характеру выражаемого отношения к действительности? Приведите примеры.
    '''
    return text


def otvet_ryss4():
    text = '''
    Ответ:
    
    
    Предложение — слово или группа слов, связанных по смыслу и грамматически и обладающих относительной смысловой и \
    интонационной завершённостью.
    
    По цели высказывания все предложения делятся на повествовательные, вопросительные и побудительные.
    
    В зависимости от наличия или отсутствия эмоциональной окрашенности предложения делятся на восклицательные \
    (эмоционально окрашенные, в речи произносятся с особым повышением тона) и невосклицательные \
    (эмоционально не окрашенные).
    
    По характеру грамматической основы на односоставные и двухсоставные
    
    Все предложения по количеству грамматических основ делятся на две группы: они бывают простые и сложные.
    
    По наличию второстепенных членов предложения на распространеные и не распространеные
    
    По условиям контекста и речевой ситуации на полные и неполные
    '''
    return text


def vopros_ryss5():
    text = '''
    Вопрос 5:
    
    
    Дайте определение термину «подлежащее». Чем выражается подлежащее? Дайте определение термину «сказуемое». \
    Какие бывают виды сказуемого? Приведите примеры.
    '''
    return text


def otvet_ryss5():
    text = '''
    Ответ:
    
    
    Подлежащее — главный член предложения, который обозначает предмет речи, то есть то, о чём говорится в предложении. \
    Отвечает на вопросы «Кто?», «Что?». Подчёркивается одной чертой. Подлежащее может быть выражено любой частью речи.
    
    В русском языке подлежащее может быть выражено любыми частями речи: Именем существительным \
    (всегда в именительном падеже): Паро́м подошёл к причалу.
     различными частями речи, перешедшими в имя существительное:\
     Именем прилагательным, перешедшим в имя существительное: Гостиная выглядела прекрасно.
     
     Сказуемое — это главный член предложения, который передает то, что говорится о подлежащем: какое действие \
     совершает подлежащее или каким признаком оно обладает.
     
У глагола есть 3 вида:
    Простое глагольное сказуемое
    Составное глагольное сказуемое
    Составное именное сказуемое
    
    
    '''
    return text


def vopros_ryss6():
    text = '''
    Вопрос 6:
    
    
    Чем выражается простое глагольное сказуемое? Из чего состоит составное глагольное сказуемое? Что выражает \
    вспомогательный глагол в составном именном сказуемом? Какие глаголы и слова (перечислите) в составных глагольных \
    сказуемых выступают в качестве вспомогательных? Что еще может выступать на месте вспомогательного глагола? \
    Приведите примеры.
    '''
    return text


def otvet_ryss6():
    text = '''
    Ответ:
    
    Простое глагольное сказуемое выражается:
Простое глагольное сказуемое (ПГС) — это сказуемое, в котором лексическое и грамматическое значение\
 чаще всего выражается одним словом — глаголом в любом наклонении и времени.

Из чего состоит составное глагольное сказуемое?
Составное глагольное сказуемое состоит из двух частей: Основная часть составного глагольного сказуемого выражает\
 лексическое значение через неопределенную форму глагола (инфинитив); Вспомогательная часть составного глагольного\
  сказуемого выражает время и наклонение глагола. Правило СГС выглядит так: составное глагольное сказуемое =\
   вспомогательный глагол + инфинитив. Схема построения составного глагольного сказуемого

Какие глаголы и слова (перечислите) в составных глагольных сказуемых выступают в качестве всп омогательных? 
Вспомогательная часть составного глагольного сказуемого может быть глаголом-связкой «быть» + краткими прилагательными\
 «рад», «готов», «обязан», «должен», «намерен», «способен», а также наречиями и существительными с модальным значением:
Я был готов (не прочь, в состоянии) подождать.

Что еще может выступать на месте вспомогательного глагола?
Фазовые глаголы, обозначающие начало, продолжение, конец действия, названного инфинитивом. Например: начать, стать,\
 приняться, кончить, перестать, прекратить, бросить (в значении перестать), продолжать, остаться.

Глаголы с модальным значением, выражающие различные оттенки модальности: возможность, невозможность,\
 предрасположенность к действию, желание, стремление, решение, старание. Например: хотеть, желать, мочь, собираться,\
  мечтать, намереваться, осмелиться, пытаться.

Также в качестве составного глагольного сказуемого рассматриваются сочетания инфинитива с предикативными\
 прилагательными, имеющими модальное значение, и глагольно-именными оборотами фразеологического типа.
    '''
    return text


def vopros_ryss7():
    text = '''
    Вопрос 7:
    
    Из чего состоит составное именное сказуемое? Какой глагол чаще всего выступает в качестве связки\
     в составном именном сказуемом? Показателем чего служит связка быть в нулевой форме? Какие глаголы (перечислите),\
      имеющие ослабленное лексическое значение, употребляются в составном именном сказуемом в роли связки? Приведите\
       примеры.
       '''
    return text


def otvet_ryss7():
    text = '''Из чего состоит составное именное сказуемое?
Составное именное сказуемое состоит из двух элементов:
Глагол-связка, который выражает грамматическое значение. В роли глагола-связки могут использоваться глаголы: \
стать, становиться, казаться, называться, представляться.
Именная часть (существительное, прилагательное, числительное, наречие и др.), которая выражает основное лексическое\
 значение.
Именная часть может быть выражена разными частями речи:
Именем существительным,
Именем прилагательным,
Именем числительным,
Наречием,
Словом состояния,
Причастием,
Фразеологизмом.

Какой глагол чаще всего выступает в качестве связки в составном именном сказуемом?
Согласно источнику, глагол-связка в составном именном сказуемом может быть представлен следующими словами:
быть; делать; стать; становиться; являться; считаться; казаться; прийти; приехать; вернуться; сидеть; стоять и др.
Связка «быть» в нулевой форме, то есть не выраженной словом, служит показателем настоящего времени изъявительного \
наклонения: _платье красивое_ (ср.: платье было красивым).

Какие глаголы (перечислите), имеющие ослабленное лексическое значение, употребляются в составном именном сказуемом в\
 роли связки?
В составном именном сказуемом в качестве связующего звена употребляются глаголы с ослабленным лексическим значением:\
 стать делаться казаться являться представляться называться и пр. Они имеют грамматическое значение наклонения, \
 времени, числа, лица или рода. А также в сказуемое эти глаголы частично вносят лексическое значение, но самостоятельно\
  не могут полноценно использоваться для передачи информации о подлежащем.
'''
    return text


def vopros_ryss8():
    text = '''
    Вопрос 8:
    
    В каких случаях между подлежащим и сказуемым ставится тире? В каких случаях между подлежащим и сказуемым не\
     ставится тире? Приведите примеры.
    '''
    return text


def otvet_ryss8():
    text = '''
    Ответ:
    
    В каких случаях между подлежащим и сказуемым ставится тире?
    
    Если оба главных члена выражены именами числительными.
    Пример:
    Дважды два - четыре
    __________   ======
    
    Если подлежащее и сказуемое выражены именами существительными в именительном падеже.
    Пример: Ватикан (подлежащие) - самое маленькое государство (сказуемое) мира.
    
    Если оба главных члена выражены глаголами в неопределенной форме (инфинитивами) или один из них выражен \
    инфинитивом, а другой — именем существительным в именительном падеже. 
    Пример: Есть такая профессия (подлежащие) - Родину защищать (сказуемое).
    (Обратите внимание на частицы Вот и это: если они есть в предложении, тире должно находиться перед ними.) 
    Пример 2: Правдивое слово - вот лекарство для души.
    Россия (подлежащие) - это много национальная страна (сказуеме).
    
    
    В каких случаях между подлежащим и сказуемым не ставится тире?
    
    Если подлежащее выражено личным местоимением.
    Пример: Мы с ним просто знакомые.
    (!(Обратите внимание!
    Если подлежащее выражено местоимением это, тире после него нужно только в том случае, если мы выделяем его по \
    смыслу и после делаем паузу. В иных случаях тире не ставят.)!) 
    
    Если между подлежащим и сказуемым стоит связка в виде сравнительного союза как, как будто, точно, словно. 
    Пример: Глядь реки словно чистое зеркало.
    
    Если сказуемое выражено именем прилагательным. 
    Пример: Осень в этом году тиха и безветренна.
    
    Если перед сказуемым стоит частица не. 
    Пример: Слово не воробей.
    '''
    return text


def vopros_ryss9():
    text = '''
    Вопрос 9:
    
    Расскажите правила согласования главных членов предложения. Приведите примеры
    '''
    return text


def otvet_ryss9():
    text = '''
    Ответ:
    
    1. Когда подлежащее выражено местоимением кто, кто-то, кто-нибудь, кто-либо или кое-кто, глагол-сказуемое нужно \
    ставить в форме мужского рода единственного числа: кто-то рассказал мне об этой книге.
    2. Если в составе подлежащего есть слова столько, сколько, много, немного, мало, немало, сказуемое должно быть в\
     форме единственного числа: сколько человек здесь было!
    3. Если в составе подлежащего используются слова большинство, меньшинство, множество, часть, ряд, допустимо\
     употреблять и единственное, и множественное число сказуемого: большинство ученикое (прочитало) прочитали\
      произведение.
    Но используют форму только единственного числа в случаях, когда:
    сказуемое предшествует подлежащему (встретилось множество друзей);
    у участвовать уолимпиаде);
    слов большинство, меньшинство, множество, часть нет зависимых слов (большинство согласилось
    услов большинство, меньшинство, множество, часть есть зависимое слово в единственном числе (большинство класса \
    подготовилась к контрольной);
    • сказуемое выражено страдательным причастием (часть арбуза была съедена на другой день).
    4. Когда подлежащие в предложении однородны и стоят в форме единственного или единственного и множественного \
    числа, сказуемое обычно употребляется во множественном числе: Машо, Никита, Юля и Женя пришли ко мне в гости.
    5. При подлежащем, выраженном сочетанием числительного и существительного, сказуемое ставится в форме единственного\
     числа, если:
    числительное оканчивается на один (сорок один человек играл в оркестре); подлежащее выражено сочетанием с \
    числительными тысяча, миллион, миллиард (на площади собралась тысяча человек);
    • подчёркивается совокупность, единство (на конференции выступило тридцать человек); в составе подлежащего есть \
    слова часов, дней, месяцев, лет (прошло двенадцать часов).
    Однако сказуемое ставится в форме множественного числа, если:
    •подлежащее выражено сочетанием существительного с числительными два, три, четыре (три девицы под окном пряли\
     поздно вечерком (А. С. Пушкин «Сказка о царе Салтане»);
    есть слова все, эти, указанные (эти шесть месяцев пролетели незаметно).
    6. При подлежащем, построенном по схеме «сущ. в Им. п. + предлог с + сущ. в Тв, п.», сказуемое ставится в форме\
     множественного числа, если подчёркивается самостоятельность и равноправность субъектов: мама с папой поехали в\
      отпуск.
    7. Если сложносокращённое слово (аббревиатура) не склоняется, то сказуемое согласуется с главным словом \
    аббревиатуры: ДТП (дорожно-транспортное происшествие) произошло на пересечении ул. Ленина и ул. Московско
    '''
    return text


def vopros_ryss10():
    text = '''
    Что такое определение? Какие части речи чаще всего выступают в качестве определения? Приведите примеры \
    согласованных и несогласованных определений. Каким типом синтаксической подчинительной связи связано\
     несогласованное определение с поясняемым словом? Приведите примеры.
    '''
    return text


def otvet_ryss10():
    text = '''
    Ответ:
    
    Что такое определение?
    Определение - это второстепеннный член предложения, который обозначает признак, качество, свойство предмета и \
    отвечает на вопросы какой? чей? который?
    
    
    Какие части речи чаще всего выступают в качестве определения?
    Чаще всего определение выражено именем прилагательным или причастием.
    
    
    Примеры согласованных и несогласованных определений.
    Согласованное определение – это определение, которое стоит в том же роде, числе и падеже, что и главное слово: \
    зелёная листва, смеющегося мальчика, эти дети, в пятом классе.
    Несогласованное определение – это определение, которое может быть выражено именем существительным, наречием или \
    инфинитивом: остановка (какая?)автобуса, мясо (какое?)по-французски, умение (какое?)слушать.
    
    
    Каким типом синтаксической подчинительной связи связано несогласованное определение с поясняемым словом?
    
    '''
    return text


def vopros_ryss11():
    text = '''
    Что такое приложение? Что обозначают приложения? В каком случае между приложением и нарицательным существительным \
    ставится дефис? Приведите примеры.
    '''
    return text


def otvet_ryss11():
    text = '''
    Ответ:
    
    Что такое приложение?
    Приложение — это определение, выраженное существительным, которое даёт другое название, характеризующее предмет.
    
    Приложения могут относиться к следующим частям речи: имена существительные; личные местоимения; \
    субстантивированные имена прилагательные, имена числительные, причастия.
    
    
    Что обозначают приложения?
    Приложение может обозначать: качество, свойство предмета; возраст; национальность; семейное положение; профессию, \
    занятие, звание; эмоциональные характеристики; географические названия; фамилии, имена, отчества; названия.
    
    
    В каком случае между приложением и нарицательным существительным ставится дефис?
    В случае, если рядом с приложением — нарицательным существительным стоит определяемое слово, тоже являющееся \
    нарицательным существительным, их обычно объединяют дефисом: ковёр-самолёт, монах-аскет. Когда за нарицательным \
    существительным следует имя собственное, дефис не ставится (боксёр Иванов), но существуют сочетания, при которых \
    нарицательное идёт за именем собственным, тогда между ними стоит дефис: Волга-матушка, Москва-река, Иван-дурак, \
    Соловей-разбойник.
    '''
    return text


def vopros_ryss12():
    text = '''
    Назовите существительные общего рода. В какой форме ставится определение при существительном общего рода? В\
     какой форме ставятся определения, относящиеся к существительным мужского рода, которые обозначают лицо по \
     профессии, должности, работе, занятию?
    '''
    return text


def otvet_ryss12():
    text = '''
    Ответ:
        
    '''
    return text


def vopros_ryss13():
    text = '''
    В какой форме употребляется определение, стоящее между числительным два, три или четыре и существительным? \
    В какой форме употребляется определение, стоящее перед числительным? Приведите примеры.
    '''
    return text


def otvet_ryss13():
    text = '''
    
    '''
    return text


def vopros_ryss14():
    text = '''
    Что такое дополнение? Какие части речи чаще всего выступают в роли дополнения? Чем еще может быть выражено \
    дополнение? Приведите примеры прямых и косвенных дополнений. В каком случае прямое дополнение может употребляться \
    и в форме родительного падежа? Приведите примеры.
    '''
    return text


def otvet_ryss14():
    text = '''

    '''
    return text


def vopros_ryss15():
    text = '''
    Составьте словосочетания со словами оплатить, заплатить, спросить, скучать, тосковать. Выделите окончание в \
    словосочетании день рождения. Исправьте тяжеловесную конструкцию Выступление артиста много раз прерывалось \
    слушателями аплодисментами.
    '''
    return text


def otvet_ryss15():
    text = '''
    
    '''
    return text


def vopros_ryss16():
    text = '''
    Что такое обстоятельство? Чем выражаются  обстоятельства? Назовите разряды обстоятельств по значению. Приведите\
     примеры. В каких случаях сравнительные обороты выделяются и не выделяются на письме запятыми? Каким членом \
     предложения являются сравнительные обороты? Приведите примеры.
    '''
    return text


def otvet_ryss16():
    text = '''
    
    '''
    return text


def vopros_ryss17():
    text = '''
    Что такое порядок слов в предложении? Расскажите о нормах расположения членов предложения. Что такое инверсия?\
     Приведите примеры
    '''
    return text


def otvet_ryss17():
    text = '''
    
    '''
    return text


def vopros_ryss18():
    text = '''
    Дайте определение двусоставного предложения. Дайте определение односоставного предложения. Какие односоставные \
    предложения являются глагольными, определенно-личными, неопределенно-личными? Приведите примеры.
    '''
    return text


def otvet_ryss18():
    text = '''
    
    '''
    return text


def vopros_ryss19():
    text = '''
    Какие односоставные предложения являются обобщенно-личными, безличными, назывными? Какие предложения могут быть\
     полными и неполными? Что такое нечленимые предложения? Приведите примеры.
    '''
    return text


def otvet_ryss19():
    text = '''
    
    '''
    return text


def vopros_ryss20():
    text = '''
    Что называется однородными членами предложения? Как связаны между собой однородные члены предложения, с помощью \
    чего такая связь выражается? Расскажите о знаках препинания при однородных членах предложения. С какой целью в \
    предложении используются однородные члены? Приведите примеры.
    '''
    return text


def otvet_ryss20():
    text = '''
    
    '''
    return text


def vopros_ryss21():
    text = '''
    Как произносятся однородные члены предложения? Какие однородные члены предложения являются распространенными и \
    нераспространенными? Являются ли повторяющиеся слова или фразеологизмы типа ни свет ни заря однородными членами\
     предложения? Приведите примеры.
    '''
    return text


def otvet_ryss21():
    text = '''
    
    '''
    return text


def vopros_ryss22():
    text = '''
    С помощью чего внешне выражается сочинительная связь в словосочетании? Приведите примеры. На какие группы делятся\
     сочинительные союзы? Приведите примеры.
    '''
    return text


def otvet_ryss22():
    text = '''
    
    '''
    return text


def vopros_ryss23():
    text = '''
    Что связывают сочинительные союзы? Что связывают подчинительные союзы? Приведите примеры.
    '''
    return text


def otvet_ryss23():
    text = '''
    
    '''
    return text


def vopros_ryss24():
    text = '''
    Какие определения являются однородными? Какие определения являются неоднородными? Как отличить однородные \
    определения от неоднородных? Требуются ли знаки препинания при неоднородных определениях?  Приведите примеры.
    '''
    return text


def otvet_ryss24():
    text = '''
    
    '''
    return text


def vopros_ryss25():
    text = '''
    Расскажите о знаках препинания при определениях, если они являются эпитетами. Расскажите о знаках препинания при \
    определениях, если определений три и больше. Расскажите о знаках препинания при сочетании определения с причастным \
    оборотом. Приведите примеры.  
    '''
    return text


def otvet_ryss25():
    text = '''
    
    '''
    return text


def vopros_ryss26():
    text = '''
    Расскажите о знаках препинания при однородных членах предложения с обобщающим словом. Как произносятся однородные \
    члены предложения с обобщающим словом? Приведите примеры. 
    '''
    return text


def otvet_ryss26():
    text = '''
    
    '''
    return text


def vopros_ryss27():
    text = '''
    Что такое обращение? Какова роль обращений? Приведите примеры риторических обращений, обращений-олицетворений. \
    Является ли обращение членом предложения? С какой интонацией используют обращения? Расскажите о знаках препинания \
    при обращениях. Приведите примеры.	
    '''
    return text


def otvet_ryss27():
    text = '''
    
    '''
    return text


def vopros_ryss28():
    text = '''
    Что такое вводные конструкции? Являются ли вводные конструкции членом предложения? Как выделяются вводные \
    конструкции на письме и в устной речи? Приведите примеры. Приведите примеры (в составе предложений) вводных слов и \
    словосочетаний, имеющих значение большей степени уверенности, меньшей степени уверенности, предположения.
    '''
    return text


def otvet_ryss28():
    text = '''
    
    '''
    return text


def vopros_ryss29():
    text = '''
    Приведите примеры (в составе предложений) вводных слов и словосочетаний, имеющих значение радости, удовольствия, \
    сожаления, огорчения, удивления, страха, опасения, источника сообщения (самого говорящего и других людей), \
    обращения к собеседнику (привлечение внимания, выражение вежливости), оформления мысли (связь мыслей, их порядок, \
    а также способ оформления мыслей).
    '''
    return text


def otvet_ryss29():
    text = '''
    
    '''
    return text


def vopros_ryss30():
    text = '''
    Что такое вводные вставные конструкции, что они передают? Как на письме и в устной речи выделяются вставные\
     конструкции? Приведите примеры.
    '''
    return text


def otvet_ryss30():
    text = '''
    
    '''
    return text


def vopros_ryss31():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss31():
    text = ''
    return text


def vopros_ryss32():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss32():
    text = ''
    return text


def vopros_ryss33():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss33():
    text = ''
    return text


def vopros_ryss34():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss34():
    text = ''
    return text


def vopros_ryss35():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss35():
    text = ''
    return text


def vopros_ryss36():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss36():
    text = ''
    return text


def vopros_ryss37():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss37():
    text = ''
    return text


def vopros_ryss38():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss38():
    text = ''
    return text


def vopros_ryss39():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss39():
    text = ''
    return text


def vopros_ryss40():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss40():
    text = ''
    return text


def vopros_ryss41():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss41():
    text = ''
    return text


def vopros_ryss42():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss42():
    text = ''
    return text


def vopros_ryss43():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss43():
    text = ''
    return text


def vopros_ryss44():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss44():
    text = ''
    return text


def vopros_ryss45():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss45():
    text = ''
    return text


def vopros_ryss46():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss46():
    text = ''
    return text


def vopros_ryss47():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss47():
    text = ''
    return text


def vopros_ryss48():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss48():
    text = ''
    return text


def vopros_ryss49():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss49():
    text = ''
    return text


def vopros_ryss50():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss50():
    text = ''
    return text


def vopros_ryss51():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss51():
    text = ''
    return text


def vopros_ryss52():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss52():
    text = ''
    return text


def vopros_ryss53():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss53():
    text = ''
    return text


def vopros_ryss54():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss54():
    text = ''
    return text


def vopros_ryss55():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss55():
    text = ''
    return text


def vopros_ryss56():
    text = 'Botintegral был создан 15 декабря 2023 года.\n'\
            'Он создан для легкой навигации в школьном процессе.'
    return text


def otvet_ryss56():
    text = ''
    return text
